# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'node'
brew 'redis'
brew 'npm'

# Apps
cask '1password'
cask 'alfred'
cask 'bear'
cask 'cyberduck'
cask 'discord'
cask 'displaylink'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'messenger'
cask 'raycast'
cask 'postman'
cask 'setapp'
cask 'screenflow'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'
cask 'warp'
cask 'zed'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'